Revit 2027 API
FolderItemInfo.ElementId Property
Note: This API is now obsolete.
 The folder parameter Id
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getGroupingParameterIdPath' method instead.")]
public ElementId ElementId { get; }
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getGroupingParameterIdPath' method instead.")>
Public ReadOnly Property ElementId As ElementId
	Get
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getGroupingParameterIdPath' method instead.")]
property ElementId^ ElementId {
	ElementId^ get ();
}
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getGroupingParameterIdPath' method instead.")>]
member ElementId : ElementId with get
Property Value
ElementId
See Also
Reference
FolderItemInfo Class
Autodesk.Revit.DB Namespace